# 081
#scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
#*valid_score, a, b = scores
#print(valid_score)

# scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
# scores.sort()
# _, *score, _ = scores
# print(sum(score)/len(score))

# 082
# scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
# _, _, *valid_score = scores
# print(valid_score)

# 083
# scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
# _, *valid_score, _ = scores
# print(valid_score)

# 084
# temp = {}
# print(temp, type(temp))

# 085
# ice = {"메로나": 1000,
#        "폴로포": 1200,
#        "빵빠레": 1800}
# print(ice)

# 086
# ice = {"메로나": 1000,
#        "폴로포": 1200,
#        "빵빠레": 1800}
#
# ice["죠스바"] = 1200
# ice["월드콘"] = 1500
# print(ice)

# 087
ice = {'메로나': 1000,
       '폴로포': 1200,
       '빵빠레': 1800,
       '죠스바': 1200,
       '월드콘': 1500}
#
# print("메로나 가격: ", ice["메로나"])

# 088
# ice = {'메로나': 1000,
#        '폴로포': 1200,
#        '빵빠레': 1800,
#        '죠스바': 1200,
#        '월드콘': 1500}
# ice["메로나"] = 1300
# print(ice)

# 089
# ice = {'메로나': 1000, '폴로포': 1200, '빵빠레': 1800, '죠스바': 1200, '월드콘': 1500}
# del ice["메로나"]
# print(ice)